pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_application_peripherals.h
/*

Copyright (c) 2010 - 2025, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF9230_ENGB_APPLICATION_PERIPHERALS_H
#define NRF9230_ENGB_APPLICATION_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdbool.h>
/*Extended UICR.*/
#define UICREXTENDED_PRESENT 1
#define UICREXTENDED_COUNT 1

/*CACHEDATA*/
#define ICACHEDATA_PRESENT 1
#define ICACHEDATA_COUNT 1

#define ICACHEDATA_NUMSETS 256
#define ICACHEDATA_NUMWAYS 2
#define ICACHEDATA_NUMDATAUNIT 4
#define ICACHEDATA_DATAWIDTH 2

/*CACHEINFO*/
#define ICACHEINFO_PRESENT 1
#define ICACHEINFO_COUNT 1

#define ICACHEINFO_NUMSETS 256
#define ICACHEINFO_NUMWAYS 2
#define ICACHEINFO_NUMDATAUNIT 4
#define ICACHEINFO_DATAWIDTH 2
#define ICACHEINFO_TAGWIDTH 19
#define ICACHEINFO_DU_EXTENSION 0

/*User information configuration registers*/
#define UICR_PRESENT 1
#define UICR_COUNT 1

/*Board information configuration registers*/
#define BICR_PRESENT 1
#define BICR_COUNT 1

#define BICR_P0_INTERNAL 1
#define BICR_P0_POWER 0
#define BICR_P1_POWER 1
#define BICR_P2_POWER 1
#define BICR_P3_POWER 0
#define BICR_P4_POWER 0
#define BICR_P5_POWER 0
#define BICR_P6_POWER 1
#define BICR_P7_POWER 0
#define BICR_P8_POWER 1
#define BICR_P9_POWER 1
#define BICR_P10_POWER 1
#define BICR_P11_POWER 1
#define BICR_P12_POWER 1
#define BICR_P13_POWER 1
#define BICR_P14_POWER 0
#define BICR_P15_POWER 0
#define BICR_P0_POWER_3V 0
#define BICR_P1_POWER_3V 0
#define BICR_P2_POWER_3V 0
#define BICR_P3_POWER_3V 0
#define BICR_P4_POWER_3V 0
#define BICR_P5_POWER_3V 0
#define BICR_P6_POWER_3V 0
#define BICR_P7_POWER_3V 0
#define BICR_P8_POWER_3V 0
#define BICR_P9_POWER_3V 1
#define BICR_P10_POWER_3V 0
#define BICR_P11_POWER_3V 0
#define BICR_P12_POWER_3V 0
#define BICR_P13_POWER_3V 0
#define BICR_P14_POWER_3V 0
#define BICR_P15_POWER_3V 0
#define BICR_P0_DRIVECTRL 0
#define BICR_P1_DRIVECTRL 0
#define BICR_P2_DRIVECTRL 0
#define BICR_P3_DRIVECTRL 0
#define BICR_P4_DRIVECTRL 0
#define BICR_P5_DRIVECTRL 0
#define BICR_P6_DRIVECTRL 1
#define BICR_P7_DRIVECTRL 0
#define BICR_P8_DRIVECTRL 1
#define BICR_P9_DRIVECTRL 0
#define BICR_P10_DRIVECTRL 0
#define BICR_P11_DRIVECTRL 0
#define BICR_P12_DRIVECTRL 0
#define BICR_P13_DRIVECTRL 0
#define BICR_P14_DRIVECTRL 0
#define BICR_P15_DRIVECTRL 0
#define BICR_P0_BIASCTRL 0
#define BICR_P1_BIASCTRL 0
#define BICR_P2_BIASCTRL 0
#define BICR_P3_BIASCTRL 0
#define BICR_P4_BIASCTRL 0
#define BICR_P5_BIASCTRL 0
#define BICR_P6_BIASCTRL 0
#define BICR_P7_BIASCTRL 0
#define BICR_P8_BIASCTRL 0
#define BICR_P9_BIASCTRL 0
#define BICR_P10_BIASCTRL 0
#define BICR_P11_BIASCTRL 0
#define BICR_P12_BIASCTRL 0
#define BICR_P13_BIASCTRL 0
#define BICR_P14_BIASCTRL 0
#define BICR_P15_BIASCTRL 0
#define BICR_PMICLDO 1

/*CACHEDATA*/
#define DCACHEDATA_PRESENT 1
#define DCACHEDATA_COUNT 1

#define DCACHEDATA_NUMSETS 256
#define DCACHEDATA_NUMWAYS 2
#define DCACHEDATA_NUMDATAUNIT 8
#define DCACHEDATA_DATAWIDTH 1

/*CACHEINFO*/
#define DCACHEINFO_PRESENT 1
#define DCACHEINFO_COUNT 1

#define DCACHEINFO_NUMSETS 256
#define DCACHEINFO_NUMWAYS 2
#define DCACHEINFO_NUMDATAUNIT 8
#define DCACHEINFO_DATAWIDTH 1
#define DCACHEINFO_TAGWIDTH 19
#define DCACHEINFO_DU_EXTENSION 1

/*Embedded Trace Macrocell*/
#define ETM_PRESENT 1
#define ETM_COUNT 1

/*Cross-Trigger Interface control*/
#define CTI_PRESENT 1
#define CTI_COUNT 3

/*CM33 SubSystem*/
#define CM33SS_PRESENT 1
#define CM33SS_COUNT 1

#define CPUC_FPUAVAILABLE 1

/*Cache*/
#define CACHE_PRESENT 1
#define CACHE_COUNT 2

#define ICACHE_VIRTUALCACHE 0
#define ICACHE_FLUSH 0
#define ICACHE_CLEAN 0
#define ICACHE_NONCACHEABLEMISS 1
#define ICACHE_BUSWIDTH_MIN 0
#define ICACHE_BUSWIDTH_MAX 63
#define ICACHE_BUSWIDTH_SIZE 64
#define ICACHE_SECUREINVALIDATE 0

#define DCACHE_VIRTUALCACHE 0
#define DCACHE_FLUSH 1
#define DCACHE_CLEAN 1
#define DCACHE_NONCACHEABLEMISS 1
#define DCACHE_BUSWIDTH_MIN 0
#define DCACHE_BUSWIDTH_MAX 63
#define DCACHE_BUSWIDTH_SIZE 64
#define DCACHE_SECUREINVALIDATE 0

/*System protection unit*/
#define SPU_PRESENT 1
#define SPU_COUNT 2

#define SPU000_BELLS 0
#define SPU000_IPCT 0
#define SPU000_DPPI 0
#define SPU000_GPIOTE 0
#define SPU000_GRTC 0
#define SPU000_GPIO 0
#define SPU000_CRACEN 0
#define SPU000_MRAMC 0
#define SPU000_COEXC 0
#define SPU000_ANTSWC 0
#define SPU000_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/

#define SPU010_BELLS 0
#define SPU010_IPCT 1
#define SPU010_DPPI 0
#define SPU010_GPIOTE 0
#define SPU010_GRTC 0
#define SPU010_GPIO 0
#define SPU010_CRACEN 0
#define SPU010_MRAMC 0
#define SPU010_COEXC 0
#define SPU010_ANTSWC 0
#define SPU010_SLAVE_BITS 4                          /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/

/*Memory Privilege Controller*/
#define MPC_PRESENT 1
#define MPC_COUNT 1

#define MPC_EXTEND_CLOCK_REQ 0
#define MPC_RTCHOKE 1
#define MPC_OVERRIDE_GRAN 4096

/*MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes.*/

