pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_application_peripherals.h
#define MVDMA_PRESENT 1
#define MVDMA_COUNT 3

#define MVDMA_COMPLETED_EVENT 1
#define MVDMA_DPPI_DISCONNECTED 0
#define MVDMA_INSTANCE_IN_WRAPPER 0

#define MVDMA120_COMPLETED_EVENT 1
#define MVDMA120_DPPI_DISCONNECTED 1
#define MVDMA120_INSTANCE_IN_WRAPPER 1

#define MVDMA121_COMPLETED_EVENT 1
#define MVDMA121_DPPI_DISCONNECTED 1
#define MVDMA121_INSTANCE_IN_WRAPPER 1

/*RAM Controller*/
#define RAMC_PRESENT 1
#define RAMC_COUNT 3

#define RAMC_ECC 0
#define RAMC_SEC 1

#define RAMC122_ECC 0
#define RAMC122_SEC 0

#define RAMC123_ECC 0
#define RAMC123_SEC 0

/*HSFLL*/
#define HSFLL_PRESENT 1
#define HSFLL_COUNT 1

#define HSFLL_DITHER_32B 1
#define HSFLL_CLOCKCTRL_MULT_RESET 6

/*LRCCONF*/
#define LRCCONF_PRESENT 1
#define LRCCONF_COUNT 2

#define LRCCONF000_POWERON 0
#define LRCCONF000_RETAIN 0
#define LRCCONF000_SYSTEMOFF 0
#define LRCCONF000_LRCREQHFXO 0
#define LRCCONF000_NCLK_MIN 0
#define LRCCONF000_NCLK_MAX 0
#define LRCCONF000_NCLK_SIZE 1
#define LRCCONF000_CLKCTRL 1
#define LRCCONF000_NACTPD_MIN 0
#define LRCCONF000_NACTPD_MAX 7
#define LRCCONF000_NACTPD_SIZE 8
#define LRCCONF000_PDACT 0
#define LRCCONF000_NPD_MIN 0
#define LRCCONF000_NPD_MAX 7
#define LRCCONF000_NPD_SIZE 8
#define LRCCONF000_OTHERON 0
#define LRCCONF000_NDOMAINS_MIN 0
#define LRCCONF000_NDOMAINS_MAX 15
#define LRCCONF000_NDOMAINS_SIZE 16
#define LRCCONF000_AX2XWAITSTATES 0
#define LRCCONF000_POWERON_MAIN_RESET 0
#define LRCCONF000_POWERON_ACT_RESET 0
#define LRCCONF000_RETAIN_MAIN_RESET 1
#define LRCCONF000_RETAIN_ACT_RESET 1

#define LRCCONF010_POWERON 1
#define LRCCONF010_RETAIN 1
#define LRCCONF010_SYSTEMOFF 1
#define LRCCONF010_LRCREQHFXO 1
#define LRCCONF010_NCLK_MIN 0
#define LRCCONF010_NCLK_MAX 0
#define LRCCONF010_NCLK_SIZE 1
#define LRCCONF010_CLKCTRL 1
#define LRCCONF010_NACTPD_MIN 0
#define LRCCONF010_NACTPD_MAX 0
#define LRCCONF010_NACTPD_SIZE 1
#define LRCCONF010_PDACT 1
#define LRCCONF010_NPD_MIN 0
#define LRCCONF010_NPD_MAX 7
#define LRCCONF010_NPD_SIZE 8
#define LRCCONF010_OTHERON 0
#define LRCCONF010_NDOMAINS_MIN 0
#define LRCCONF010_NDOMAINS_MAX 15
#define LRCCONF010_NDOMAINS_SIZE 16
#define LRCCONF010_AX2XWAITSTATES 0
#define LRCCONF010_POWERON_MAIN_RESET 0
#define LRCCONF010_POWERON_ACT_RESET 0
#define LRCCONF010_RETAIN_MAIN_RESET 1
#define LRCCONF010_RETAIN_ACT_RESET 1

/*Memory configuration*/
#define MEMCONF_PRESENT 1
#define MEMCONF_COUNT 1

#define MEMCONF_RETTRIM 1
#define MEMCONF_REPAIR 0
#define MEMCONF_POWER 1

/*Watchdog Timer*/
#define WDT_PRESENT 1
#define WDT_COUNT 4

#define WDT010_ALLOW_STOP 0
#define WDT010_HAS_INTEN 0

#define WDT011_ALLOW_STOP 0
#define WDT011_HAS_INTEN 0

#define WDT131_ALLOW_STOP 0
#define WDT131_HAS_INTEN 0

#define WDT132_ALLOW_STOP 0
#define WDT132_HAS_INTEN 0

/*ABB peripheral*/
#define ABB_PRESENT 1
#define ABB_COUNT 1

/*RESETINFO*/
#define RESETINFO_PRESENT 1
#define RESETINFO_COUNT 1

#define RESETINFO_HASRESETREAS 1
#define RESETINFO_CROSSDOMAINRESET 1

/*IPCT APB registers*/
#define IPCT_PRESENT 1
#define IPCT_COUNT 3

#define IPCT_IRQ_COUNT 2

#define IPCT120_IRQ_COUNT 1

#define IPCT130_IRQ_COUNT 1

/*Software interrupt*/
#define SWI_PRESENT 1
#define SWI_COUNT 8

/*BELLBOARD APB registers*/
#define BELLBOARD_PRESENT 1
#define BELLBOARD_COUNT 1

#define BELLBOARD_IRQ_COUNT 4

/*Factory Information Configuration Registers*/
#define FICR_PRESENT 1
#define FICR_COUNT 1

/*USBHSCORE*/
#define USBHSCORE_PRESENT 1
#define USBHSCORE_COUNT 1

/*I3CCORE*/
#define I3CCORE_PRESENT 1
#define I3CCORE_COUNT 2

/*DMU*/
#define DMU_PRESENT 1
#define DMU_COUNT 2

/*MCAN*/
#define MCAN_PRESENT 1
#define MCAN_COUNT 2

/*System Trace Macrocell data buffer*/
#define STMDATA_PRESENT 1
#define STMDATA_COUNT 1

/*TDDCONF*/
#define TDDCONF_PRESENT 1
#define TDDCONF_COUNT 1

#define TDDCONF_FEATEN_TDDCONF_CLK_320MHZ 0
#define TDDCONF_FEATEN_TDDCONF_CLK_400MHZ 1

/*System Trace Macrocell*/
#define STM_PRESENT 1
#define STM_COUNT 1

/*Trace Port Interface Unit*/
#define TPIU_PRESENT 1
#define TPIU_COUNT 1

/*ATB Replicator module*/
#define ATBREPLICATOR_PRESENT 1
#define ATBREPLICATOR_COUNT 4

/*ATB funnel module*/
#define ATBFUNNEL_PRESENT 1
#define ATBFUNNEL_COUNT 4

/*GPIO Tasks and Events*/
#define GPIOTE_PRESENT 1
#define GPIOTE_COUNT 2

#define GPIOTE130_IRQ_COUNT 2
#define GPIOTE130_GPIOTE_NCHANNELS_MIN 0
#define GPIOTE130_GPIOTE_NCHANNELS_MAX 7
#define GPIOTE130_GPIOTE_NCHANNELS_SIZE 8
#define GPIOTE130_GPIOTE_NPORTEVENTS_MIN 0
#define GPIOTE130_GPIOTE_NPORTEVENTS_MAX 3
#define GPIOTE130_GPIOTE_NPORTEVENTS_SIZE 4
#define GPIOTE130_GPIOTE_NINTERRUPTS_MIN 0
#define GPIOTE130_GPIOTE_NINTERRUPTS_MAX 1
#define GPIOTE130_GPIOTE_NINTERRUPTS_SIZE 2
#define GPIOTE130_HAS_PORT_EVENT 1

#define GPIOTE131_IRQ_COUNT 2
#define GPIOTE131_GPIOTE_NCHANNELS_MIN 0
#define GPIOTE131_GPIOTE_NCHANNELS_MAX 7
#define GPIOTE131_GPIOTE_NCHANNELS_SIZE 8
#define GPIOTE131_GPIOTE_NPORTEVENTS_MIN 0
#define GPIOTE131_GPIOTE_NPORTEVENTS_MAX 3
#define GPIOTE131_GPIOTE_NPORTEVENTS_SIZE 4
#define GPIOTE131_GPIOTE_NINTERRUPTS_MIN 0
#define GPIOTE131_GPIOTE_NINTERRUPTS_MAX 1
#define GPIOTE131_GPIOTE_NINTERRUPTS_SIZE 2
#define GPIOTE131_HAS_PORT_EVENT 1

/*Global Real-time counter*/
#define GRTC_PRESENT 1
#define GRTC_COUNT 1

#define GRTC_IRQ_COUNT 3
#define GRTC_MSBWIDTH_MIN 0                          /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_MSBWIDTH_MAX 14                         /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_MSBWIDTH_SIZE 15                        /*!< Width of the RTCOUNTERH, RTCOMPAREH and RTCOMPARESYNCH registers :
                                                          0..14*/
#define GRTC_NCC_MIN 0
#define GRTC_NCC_MAX 15
#define GRTC_NCC_SIZE 16
#define GRTC_NTIMEOUT_MIN 0
#define GRTC_NTIMEOUT_MAX 15
#define GRTC_NTIMEOUT_SIZE 16
#define GRTC_NDOMAIN_MIN 0
#define GRTC_NDOMAIN_MAX 15
#define GRTC_NDOMAIN_SIZE 16
#define GRTC_GRTC_NINTERRUPTS_MIN 0
#define GRTC_GRTC_NINTERRUPTS_MAX 2
#define GRTC_GRTC_NINTERRUPTS_SIZE 3
#define GRTC_PWMREGS 1
#define GRTC_CLKOUTREG 1
#define GRTC_CLKSELREG 1
#define GRTC_CLKSELLFLPRC 0
#define GRTC_CCADD_WRITE_ONLY 0
#define GRTC_READY_STATUS_AND_EVENTS 0

/*Trace buffer monitor*/
#define TBM_PRESENT 1
#define TBM_COUNT 1

