pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_application_peripherals.h
/*USBHS*/
#define USBHS_PRESENT 1
#define USBHS_COUNT 1

/*External Memory Interface*/
#define EXMIF_PRESENT 1
#define EXMIF_COUNT 1

/*BELLBOARD public registers*/
#define BELLBOARDPUBLIC_PRESENT 1
#define BELLBOARDPUBLIC_COUNT 1

/*AUXPLL*/
#define AUXPLL_PRESENT 1
#define AUXPLL_COUNT 1

/*VPR peripheral registers*/
#define VPRPUBLIC_PRESENT 1
#define VPRPUBLIC_COUNT 1

#define VPR120_VEVIF_NTASKS_MIN 0
#define VPR120_VEVIF_NTASKS_MAX 31
#define VPR120_VEVIF_NTASKS_SIZE 32
#define VPR120_VEVIF_TASKS_MASK 0xFFFFF0FF

/*MUTEX*/
#define MUTEX_PRESENT 1
#define MUTEX_COUNT 2

/*I3C*/
#define I3C_PRESENT 1
#define I3C_COUNT 2

/*VPR peripheral registers*/
#define VPR_PRESENT 1
#define VPR_COUNT 2

#define VPR121_INIT_PC_RESET_VALUE 0x00000000
#define VPR121_VPR_START_RESET_VALUE 0
#define VPR121_RAM_BASE_ADDR 0x2F890000
#define VPR121_RAM_SZ 15
#define VPR121_VPRSAVEDCTX_REGNAME NRF_MEMCONF120->POWER[0].RET
#define VPR121_VPRSAVEDCTX_REGBIT 23
#define VPR121_RETAINED 0
#define VPR121_VPRSAVEDCTX 1
#define VPR121_VPRSAVEADDR 0x2F800000
#define VPR121_VPRREMAPADDRVTOB 0x00000000
#define VPR121_VEVIF_NTASKS_MIN 0
#define VPR121_VEVIF_NTASKS_MAX 31
#define VPR121_VEVIF_NTASKS_SIZE 32
#define VPR121_VEVIF_TASKS_MASK 0xFFFF0000
#define VPR121_VEVIF_NDPPI_MIN 24
#define VPR121_VEVIF_NDPPI_MAX 27
#define VPR121_VEVIF_NDPPI_SIZE 28
#define VPR121_VEVIF_NEVENTS_MIN 28
#define VPR121_VEVIF_NEVENTS_MAX 31
#define VPR121_VEVIF_NEVENTS_SIZE 32
#define VPR121_DEBUGGER_OFFSET 1024

#define VPR130_INIT_PC_RESET_VALUE 0x00000000
#define VPR130_VPR_START_RESET_VALUE 0
#define VPR130_RAM_BASE_ADDR 0x2FC00000
#define VPR130_RAM_SZ 15
#define VPR130_VPRSAVEDCTX_REGNAME NRF_MEMCONF130->POWER[0].RET
#define VPR130_VPRSAVEDCTX_REGBIT 5
#define VPR130_RETAINED 1
#define VPR130_VPRSAVEDCTX 1
#define VPR130_VPRSAVEADDR 0x2F800000
#define VPR130_VPRREMAPADDRVTOB 0x00000000
#define VPR130_VEVIF_NTASKS_MIN 0
#define VPR130_VEVIF_NTASKS_MAX 15
#define VPR130_VEVIF_NTASKS_SIZE 16
#define VPR130_VEVIF_TASKS_MASK 0x0000FFF0
#define VPR130_VEVIF_NDPPI_MIN 8
#define VPR130_VEVIF_NDPPI_MAX 11
#define VPR130_VEVIF_NDPPI_SIZE 12
#define VPR130_VEVIF_NEVENTS_MIN 12
#define VPR130_VEVIF_NEVENTS_MAX 15
#define VPR130_VEVIF_NEVENTS_SIZE 16
#define VPR130_DEBUGGER_OFFSET 1024

/*Controller Area Network*/
#define CAN_PRESENT 1
#define CAN_COUNT 2

/*Distributed programmable peripheral interconnect controller*/
#define DPPIC_PRESENT 1
#define DPPIC_COUNT 8

#define DPPIC120_HASCHANNELGROUPS 1
#define DPPIC120_CH_NUM_MIN 0
#define DPPIC120_CH_NUM_MAX 7
#define DPPIC120_CH_NUM_SIZE 8
#define DPPIC120_GROUP_NUM_MIN 0
#define DPPIC120_GROUP_NUM_MAX 1
#define DPPIC120_GROUP_NUM_SIZE 2

#define DPPIC130_HASCHANNELGROUPS 1
#define DPPIC130_CH_NUM_MIN 0
#define DPPIC130_CH_NUM_MAX 7
#define DPPIC130_CH_NUM_SIZE 8
#define DPPIC130_GROUP_NUM_MIN 0
#define DPPIC130_GROUP_NUM_MAX 1
#define DPPIC130_GROUP_NUM_SIZE 2

#define DPPIC131_HASCHANNELGROUPS 1
#define DPPIC131_CH_NUM_MIN 0
#define DPPIC131_CH_NUM_MAX 7
#define DPPIC131_CH_NUM_SIZE 8
#define DPPIC131_GROUP_NUM_MIN 0
#define DPPIC131_GROUP_NUM_MAX 1
#define DPPIC131_GROUP_NUM_SIZE 2

#define DPPIC132_HASCHANNELGROUPS 1
#define DPPIC132_CH_NUM_MIN 0
#define DPPIC132_CH_NUM_MAX 7
#define DPPIC132_CH_NUM_SIZE 8
#define DPPIC132_GROUP_NUM_MIN 0
#define DPPIC132_GROUP_NUM_MAX 1
#define DPPIC132_GROUP_NUM_SIZE 2

#define DPPIC133_HASCHANNELGROUPS 1
#define DPPIC133_CH_NUM_MIN 0
#define DPPIC133_CH_NUM_MAX 7
#define DPPIC133_CH_NUM_SIZE 8
#define DPPIC133_GROUP_NUM_MIN 0
#define DPPIC133_GROUP_NUM_MAX 1
#define DPPIC133_GROUP_NUM_SIZE 2

#define DPPIC134_HASCHANNELGROUPS 1
#define DPPIC134_CH_NUM_MIN 0
#define DPPIC134_CH_NUM_MAX 7
#define DPPIC134_CH_NUM_SIZE 8
#define DPPIC134_GROUP_NUM_MIN 0
#define DPPIC134_GROUP_NUM_MAX 1
#define DPPIC134_GROUP_NUM_SIZE 2

#define DPPIC135_HASCHANNELGROUPS 1
#define DPPIC135_CH_NUM_MIN 0
#define DPPIC135_CH_NUM_MAX 7
#define DPPIC135_CH_NUM_SIZE 8
#define DPPIC135_GROUP_NUM_MIN 0
#define DPPIC135_GROUP_NUM_MAX 1
#define DPPIC135_GROUP_NUM_SIZE 2

#define DPPIC136_HASCHANNELGROUPS 1
#define DPPIC136_CH_NUM_MIN 0
#define DPPIC136_CH_NUM_MAX 7
#define DPPIC136_CH_NUM_SIZE 8
#define DPPIC136_GROUP_NUM_MIN 0
#define DPPIC136_GROUP_NUM_MAX 1
#define DPPIC136_GROUP_NUM_SIZE 2

/*Timer/Counter*/
#define TIMER_PRESENT 1
#define TIMER_COUNT 10

#define TIMER120_CC_NUM_MIN 0
#define TIMER120_CC_NUM_MAX 5
#define TIMER120_CC_NUM_SIZE 6
#define TIMER120_MAX_SIZE_MIN 0
#define TIMER120_MAX_SIZE_MAX 31
#define TIMER120_MAX_SIZE_SIZE 32
#define TIMER120_PCLK_MHZ 320
#define TIMER120_PCLK_VARIABLE 0

#define TIMER121_CC_NUM_MIN 0
#define TIMER121_CC_NUM_MAX 5
#define TIMER121_CC_NUM_SIZE 6
#define TIMER121_MAX_SIZE_MIN 0
#define TIMER121_MAX_SIZE_MAX 31
#define TIMER121_MAX_SIZE_SIZE 32
#define TIMER121_PCLK_MHZ 320
#define TIMER121_PCLK_VARIABLE 0

#define TIMER130_CC_NUM_MIN 0
#define TIMER130_CC_NUM_MAX 5
#define TIMER130_CC_NUM_SIZE 6
#define TIMER130_MAX_SIZE_MIN 0
#define TIMER130_MAX_SIZE_MAX 31
#define TIMER130_MAX_SIZE_SIZE 32
#define TIMER130_PCLK_MHZ 16
#define TIMER130_PCLK_VARIABLE 0

#define TIMER131_CC_NUM_MIN 0
#define TIMER131_CC_NUM_MAX 5
#define TIMER131_CC_NUM_SIZE 6
#define TIMER131_MAX_SIZE_MIN 0
#define TIMER131_MAX_SIZE_MAX 31
#define TIMER131_MAX_SIZE_SIZE 32
#define TIMER131_PCLK_MHZ 16
#define TIMER131_PCLK_VARIABLE 0

#define TIMER132_CC_NUM_MIN 0
#define TIMER132_CC_NUM_MAX 5
#define TIMER132_CC_NUM_SIZE 6
#define TIMER132_MAX_SIZE_MIN 0
#define TIMER132_MAX_SIZE_MAX 31
#define TIMER132_MAX_SIZE_SIZE 32
#define TIMER132_PCLK_MHZ 16
#define TIMER132_PCLK_VARIABLE 0

#define TIMER133_CC_NUM_MIN 0
#define TIMER133_CC_NUM_MAX 5
#define TIMER133_CC_NUM_SIZE 6
#define TIMER133_MAX_SIZE_MIN 0
#define TIMER133_MAX_SIZE_MAX 31
#define TIMER133_MAX_SIZE_SIZE 32
#define TIMER133_PCLK_MHZ 16
#define TIMER133_PCLK_VARIABLE 0

#define TIMER134_CC_NUM_MIN 0
#define TIMER134_CC_NUM_MAX 5
#define TIMER134_CC_NUM_SIZE 6
#define TIMER134_MAX_SIZE_MIN 0
#define TIMER134_MAX_SIZE_MAX 31
#define TIMER134_MAX_SIZE_SIZE 32
#define TIMER134_PCLK_MHZ 16
#define TIMER134_PCLK_VARIABLE 0

#define TIMER135_CC_NUM_MIN 0
#define TIMER135_CC_NUM_MAX 5
#define TIMER135_CC_NUM_SIZE 6
#define TIMER135_MAX_SIZE_MIN 0
#define TIMER135_MAX_SIZE_MAX 31
#define TIMER135_MAX_SIZE_SIZE 32
#define TIMER135_PCLK_MHZ 16
#define TIMER135_PCLK_VARIABLE 0

#define TIMER136_CC_NUM_MIN 0
#define TIMER136_CC_NUM_MAX 5
#define TIMER136_CC_NUM_SIZE 6
#define TIMER136_MAX_SIZE_MIN 0
#define TIMER136_MAX_SIZE_MAX 31
#define TIMER136_MAX_SIZE_SIZE 32
#define TIMER136_PCLK_MHZ 16
#define TIMER136_PCLK_VARIABLE 0

