pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_application_peripherals.h
#define SPIM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM131_MAX_DATARATE 8
#define SPIM131_EASYDMA_MAXCNT_MIN 0
#define SPIM131_EASYDMA_MAXCNT_MAX 14
#define SPIM131_EASYDMA_MAXCNT_SIZE 15
#define SPIM131_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM131_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM131_FEATURE_RXDELAY_PRESENT 1
#define SPIM131_STALL_STATUS_PRESENT 0
#define SPIM131_STALL_STATUS_TX_PRESENT 0
#define SPIM131_NUM_CHIPSELECT_MIN 0
#define SPIM131_NUM_CHIPSELECT_MAX 0
#define SPIM131_NUM_CHIPSELECT_SIZE 1
#define SPIM131_CORE_FREQUENCY 16
#define SPIM131_PRESCALER_PRESENT 1
#define SPIM131_PRESCALER_DIVISOR_RANGE_MIN 2
#define SPIM131_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM131_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM131_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM131_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM131_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM131_RXDELAY_RESET_VALUE 2
#define SPIM131_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM131_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM131_RXDELAY_FIELD_WIDTH_SIZE 3

#define SPIM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM132_MAX_DATARATE 8
#define SPIM132_EASYDMA_MAXCNT_MIN 0
#define SPIM132_EASYDMA_MAXCNT_MAX 14
#define SPIM132_EASYDMA_MAXCNT_SIZE 15
#define SPIM132_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM132_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM132_FEATURE_RXDELAY_PRESENT 1
#define SPIM132_STALL_STATUS_PRESENT 0
#define SPIM132_STALL_STATUS_TX_PRESENT 0
#define SPIM132_NUM_CHIPSELECT_MIN 0
#define SPIM132_NUM_CHIPSELECT_MAX 0
#define SPIM132_NUM_CHIPSELECT_SIZE 1
#define SPIM132_CORE_FREQUENCY 16
#define SPIM132_PRESCALER_PRESENT 1
#define SPIM132_PRESCALER_DIVISOR_RANGE_MIN 2
#define SPIM132_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM132_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM132_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM132_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM132_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM132_RXDELAY_RESET_VALUE 2
#define SPIM132_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM132_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM132_RXDELAY_FIELD_WIDTH_SIZE 3

#define SPIM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM133_MAX_DATARATE 8
#define SPIM133_EASYDMA_MAXCNT_MIN 0
#define SPIM133_EASYDMA_MAXCNT_MAX 14
#define SPIM133_EASYDMA_MAXCNT_SIZE 15
#define SPIM133_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM133_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM133_FEATURE_RXDELAY_PRESENT 1
#define SPIM133_STALL_STATUS_PRESENT 0
#define SPIM133_STALL_STATUS_TX_PRESENT 0
#define SPIM133_NUM_CHIPSELECT_MIN 0
#define SPIM133_NUM_CHIPSELECT_MAX 0
#define SPIM133_NUM_CHIPSELECT_SIZE 1
#define SPIM133_CORE_FREQUENCY 16
#define SPIM133_PRESCALER_PRESENT 1
#define SPIM133_PRESCALER_DIVISOR_RANGE_MIN 2
#define SPIM133_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM133_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM133_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM133_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM133_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM133_RXDELAY_RESET_VALUE 2
#define SPIM133_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM133_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM133_RXDELAY_FIELD_WIDTH_SIZE 3

#define SPIM134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM134_MAX_DATARATE 8
#define SPIM134_EASYDMA_MAXCNT_MIN 0
#define SPIM134_EASYDMA_MAXCNT_MAX 14
#define SPIM134_EASYDMA_MAXCNT_SIZE 15
#define SPIM134_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM134_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM134_FEATURE_RXDELAY_PRESENT 1
#define SPIM134_STALL_STATUS_PRESENT 0
#define SPIM134_STALL_STATUS_TX_PRESENT 0
#define SPIM134_NUM_CHIPSELECT_MIN 0
#define SPIM134_NUM_CHIPSELECT_MAX 0
#define SPIM134_NUM_CHIPSELECT_SIZE 1
#define SPIM134_CORE_FREQUENCY 16
#define SPIM134_PRESCALER_PRESENT 1
#define SPIM134_PRESCALER_DIVISOR_RANGE_MIN 2
#define SPIM134_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM134_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM134_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM134_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM134_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM134_RXDELAY_RESET_VALUE 2
#define SPIM134_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM134_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM134_RXDELAY_FIELD_WIDTH_SIZE 3

#define SPIM135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM135_MAX_DATARATE 8
#define SPIM135_EASYDMA_MAXCNT_MIN 0
#define SPIM135_EASYDMA_MAXCNT_MAX 14
#define SPIM135_EASYDMA_MAXCNT_SIZE 15
#define SPIM135_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM135_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM135_FEATURE_RXDELAY_PRESENT 1
#define SPIM135_STALL_STATUS_PRESENT 0
#define SPIM135_STALL_STATUS_TX_PRESENT 0
#define SPIM135_NUM_CHIPSELECT_MIN 0
#define SPIM135_NUM_CHIPSELECT_MAX 0
#define SPIM135_NUM_CHIPSELECT_SIZE 1
#define SPIM135_CORE_FREQUENCY 16
#define SPIM135_PRESCALER_PRESENT 1
#define SPIM135_PRESCALER_DIVISOR_RANGE_MIN 2
#define SPIM135_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM135_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM135_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM135_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM135_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM135_RXDELAY_RESET_VALUE 2
#define SPIM135_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM135_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM135_RXDELAY_FIELD_WIDTH_SIZE 3

#define SPIM136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1
#define SPIM136_MAX_DATARATE 8
#define SPIM136_EASYDMA_MAXCNT_MIN 0
#define SPIM136_EASYDMA_MAXCNT_MAX 14
#define SPIM136_EASYDMA_MAXCNT_SIZE 15
#define SPIM136_FEATURE_HARDWARE_CSN_PRESENT 1
#define SPIM136_FEATURE_HARDWARE_DCX_PRESENT 1
#define SPIM136_FEATURE_RXDELAY_PRESENT 1
#define SPIM136_STALL_STATUS_PRESENT 0
#define SPIM136_STALL_STATUS_TX_PRESENT 0
#define SPIM136_NUM_CHIPSELECT_MIN 0
#define SPIM136_NUM_CHIPSELECT_MAX 0
#define SPIM136_NUM_CHIPSELECT_SIZE 1
#define SPIM136_CORE_FREQUENCY 16
#define SPIM136_PRESCALER_PRESENT 1
#define SPIM136_PRESCALER_DIVISOR_RANGE_MIN 2
#define SPIM136_PRESCALER_DIVISOR_RANGE_MAX 126
#define SPIM136_PRESCALER_DIVISOR_RANGE_SIZE 127
#define SPIM136_RXDELAY_VALUE_RANGE_MIN 0
#define SPIM136_RXDELAY_VALUE_RANGE_MAX 7
#define SPIM136_RXDELAY_VALUE_RANGE_SIZE 8
#define SPIM136_RXDELAY_RESET_VALUE 2
#define SPIM136_RXDELAY_FIELD_WIDTH_MIN 0
#define SPIM136_RXDELAY_FIELD_WIDTH_MAX 2
#define SPIM136_RXDELAY_FIELD_WIDTH_SIZE 3

